app/controllers/posts_controller.rb

	def index
		#@posts = Post.all.by_last_updated_at
		@posts = Post.by_last_updated_at.paginate(page:params[:page],per_page:5)
---
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."updated_at" DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `posts`

	def create
		@post = Post.create(post_params)
		if @post.save
---
INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`) VALUES ('7', '7', '2015-09-09 05:05:57', '2015-09-09 05:05:57')
UPDATE `posts` SET `user_id` = 1, `updated_at` = '2015-09-09 05:05:57' WHERE `posts`.`id` = 6

    def find_post
		@post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1